In [4]:
import numpy as np
import pandas as pd
s1 = pd.Series([7.3, -2.5, 3.4, 1.5],index=['a','b','c','d'])
s2 = pd.Series([-2.1, 3.6, -1.5, 3.1],index=['b','a','c','d'])
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [5]:
s2

b   -2.1
a    3.6
c   -1.5
d    3.1
dtype: float64

In [6]:
s1 + s2

a    10.9
b    -4.6
c     1.9
d     4.6
dtype: float64

In [7]:
s1 = pd.Series([7.3, -2.5, np.nan, 1.5],index=['a','b','c','d'])
s2 = pd.Series([-2.1, 3.6, -1.5, 3.1],index=['b','a','c','d'])
s1

a    7.3
b   -2.5
c    NaN
d    1.5
dtype: float64

In [8]:
s2

b   -2.1
a    3.6
c   -1.5
d    3.1
dtype: float64

In [9]:
s1+s2

a    10.9
b    -4.6
c     NaN
d     4.6
dtype: float64

In [12]:
df1 = pd.DataFrame(np.arange(9.0).reshape(3,3),
                   columns = list('bcd'),
                   index=['台北','台中','台南']
                  )
df1

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0
台南  6.0  7.0  8.0

In [13]:
df2 = pd.DataFrame(np.arange(9.0).reshape(3,3),
                   columns = list('bcd'),
                   index=['台北','台中','台南']
                  )
df2

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0
台南  6.0  7.0  8.0

In [14]:
df1 + df2

       b     c     d
台北   0.0   2.0   4.0
台中   6.0   8.0  10.0
台南  12.0  14.0  16.0

In [15]:
df2 = pd.DataFrame(np.arange(6.0).reshape(2,3),
                   columns = list('bcd'),
                   index=['台北','台中']
                  )
df2

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0

In [16]:
df1

      b    c    d
台北  0.0  1.0  2.0
台中  3.0  4.0  5.0
台南  6.0  7.0  8.0

In [17]:
df1+df2

      b    c     d
台中  6.0  8.0  10.0
台北  0.0  2.0   4.0
台南  NaN  NaN   NaN

In [18]:
df1.add(df2,fill_value=0)

      b    c     d
台中  6.0  8.0  10.0
台北  0.0  2.0   4.0
台南  6.0  7.0   8.0

In [21]:
df1 / 2 + 2

      b    c    d
台北  2.0  2.5  3.0
台中  3.5  4.0  4.5
台南  5.0  5.5  6.0